In [32]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
plt.rcParams["figure.figsize"] = [10, 6]

In [135]:
header_list = ["Name", "Sex", "Name_Count"]
df = pd.read_csv("C:/Users/Siddharth/Desktop/Blog/Data/names/yob2020.txt", delimiter = ",", names=header_list)

In [136]:
df.head()

        Name Sex  Name_Count
0     Olivia   F       17535
1       Emma   F       15581
2        Ava   F       13084
3  Charlotte   F       13003
4     Sophia   F       12976

In [137]:
df.groupby(['Sex']).sum()

     Name_Count
Sex
F       1598836
M       1706423

In [138]:
df_most_popular_m=df.loc[df['Sex']=='M'].nlargest(50,'Name_Count')
df_most_popular_m.head(10)

            Name Sex  Name_Count
17360       Liam   M       19659
17361       Noah   M       18252
17362     Oliver   M       14147
17363     Elijah   M       13034
17364    William   M       12541
17365      James   M       12250
17366   Benjamin   M       12136
17367      Lucas   M       11281
17368      Henry   M       10705
17369  Alexander   M       10151

In [139]:
df_most_popular_f=df.loc[df['Sex']=='F'].nlargest(50,'Name_Count')
df_most_popular_f.head(10)

        Name Sex  Name_Count
0     Olivia   F       17535
1       Emma   F       15581
2        Ava   F       13084
3  Charlotte   F       13003
4     Sophia   F       12976
5     Amelia   F       12704
6   Isabella   F       12066
7        Mia   F       11157
8     Evelyn   F        9445
9     Harper   F        8778

In [140]:
df['First_Letter']=df['Name'].str[0]
df['Last_Letter']=df['Name'].str[-1]
df['Name_Length']=df['Name'].str.len()

In [108]:
df.head()

        Name Sex  Name_Count First_Letter Last_Letter  Name_Length
0     Olivia   F       17535            O           a            6
1       Emma   F       15581            E           a            4
2        Ava   F       13084            A           a            3
3  Charlotte   F       13003            C           e            9
4     Sophia   F       12976            S           a            6

In [109]:
df_first_letter_m=df.loc[df['Sex']=='M'].groupby(['Sex','First_Letter']).sum()
df_first_letter_f=df.loc[df['Sex']=='F'].groupby(['Sex','First_Letter']).sum()
df_last_letter_m=df.loc[df['Sex']=='M'].groupby(['Sex','Last_Letter']).sum()
df_last_letter_f=df.loc[df['Sex']=='F'].groupby(['Sex','Last_Letter']).sum()

In [110]:
df_first_letter_m.sort_values(by=['Name_Count'], ascending=False)

                  Name_Count  Name_Length
Sex First_Letter
M   J                 205957         7504
    A                 176384         9226
    L                 127299         2856
    M                 126356         5846
    C                 122727         4354
    E                 106893         3105
    K                  93834         7885
    D                  86043         5450
    B                  85391         3950
    R                  78977         4345
    S                  67911         4954
    T                  56942         3869
    N                  55521         2437
    G                  53447         1995
    H                  48149         2408
    W                  45381         1104
    O                  37011         1408
    I                  31960         1244
    Z                  25383         2181
    P                  24140         1294
    F                  19348         1322
    V                  10701          948
    Y                   7939         1452
    X                   7242          382
    Q                   3055          342
    U                   2432          249

In [111]:
df_first_letter_f.sort_values(by=['Name_Count'], ascending=False)

                  Name_Count  Name_Length
Sex First_Letter
F   A                 272810        17133
    E                 151472         5924
    M                 141420         9718
    S                 112904         7403
    L                 112461         6086
    C                  92431         5210
    K                  91208         9764
    J                  72790         6881
    R                  72258         5113
    N                  55705         4286
    H                  54516         2919
    B                  49851         4029
    G                  43757         2232
    I                  42103         2040
    D                  38679         4333
    P                  37182         1784
    V                  32404         1284
    Z                  28628         2959
    O                  27395          937
    T                  24299         3238
    F                  15985         1337
    W                  12288          775
    Y                   7623         1534
    X                   4035          408
    Q                   4006          225
    U                    626          138

In [112]:
df_last_letter_m.sort_values(by=['Name_Count'], ascending=False)

                 Name_Count  Name_Length
Sex Last_Letter
M   n                537262        25838
    r                162439         6537
    s                133040         5333
    e                115556         6899
    l                111521         5304
    o                102618         4700
    h                 93013         3765
    y                 81538         3860
    m                 56082         2140
    t                 56026         1520
    i                 55353         4888
    d                 38591         2477
    k                 34824         1888
    a                 33463         2383
    x                 19912          604
    b                 17947          516
    w                 17057          171
    c                 16541          528
    u                  5759          490
    g                  4551          425
    z                  3432          615
    v                  2864          353
    f                  2677          390
    p                  2580          110
    j                  1449          275
    q                   328          101

In [113]:
df_last_letter_f.sort_values(by=['Name_Count'], ascending=False)

                 Name_Count  Name_Length
Sex Last_Letter
F   a                610878        35628
    e                283355        17839
    n                182167        13931
    y                176389         7692
    h                110637        11658
    i                 76230        10411
    r                 53200         1736
    l                 33909         2328
    t                 23570         1291
    s                 18816         1976
    w                  6664          107
    m                  6648          587
    d                  3773          477
    o                  3463          522
    x                  3347          323
    u                  1066          370
    z                  1047          270
    c                   884           78
    g                   702          116
    k                   578          125
    b                   530           94
    v                   463           17
    f                   161           22
    p                   152           17
    j                   139           42
    q                    68           33

In [114]:
df_length_m=df.loc[df['Sex']=='M'].groupby(['Sex','Name_Length']).sum()
df_length_f=df.loc[df['Sex']=='F'].groupby(['Sex','Name_Length']).sum()

In [115]:
df_length_m

                 Name_Count
Sex Name_Length
M   2                  1717
    3                 45660
    4                276102
    5                445167
    6                507343
    7                268933
    8                105519
    9                 43583
    10                 3720
    11                 8348
    12                  203
    13                  113
    14                   15

In [116]:
df_length_f

                 Name_Count
Sex Name_Length
F   2                   260
    3                 56779
    4                212971
    5                338540
    6                459319
    7                305725
    8                144328
    9                 72152
    10                 8217
    11                  334
    12                   64
    13                  132
    14                   15

In [117]:
df_list = [df_most_popular_m,df_most_popular_f,df_first_letter_m, df_first_letter_f,df_last_letter_m,df_last_letter_f,df_length_m,df_length_f]

In [126]:
xls_path='C:/Users/Siddharth/Desktop/Blog/Data/names/raw_data.xlsx'

def save_xls(df_list, xls_path):
    with pd.ExcelWriter(xls_path) as writer:
        for n, df in enumerate(df_list):
            df.to_excel(writer,'sheet%s' % n)
        writer.save()
        
save_xls(df_list,xls_path)

In [147]:
df.loc[(df['Sex']=='M') & (df['Last_Letter']=='n')].nlargest(50,'Name_Count')

            Name Sex  Name_Count First_Letter Last_Letter  Name_Length
17366   Benjamin   M       12136            B           n            8
17370      Mason   M       10029            M           n            5
17372      Ethan   M        9464            E           n            5
17375      Logan   M        9086            L           n            5
17376    Jackson   M        9051            J           n            7
17378  Sebastian   M        8927            S           n            9
17381       Owen   M        8623            O           n            4
17383      Aiden   M        8534            A           n            5
17386       John   M        8180            J           n            4
17393     Julian   M        7488            J           n            6
17394    Grayson   M        7424            G           n            7
17396     Jayden   M        7102            J           n            6
17399    Lincoln   M        6998            L           n            7
17401     Hudson   M        6807            H           n            6
17402      Dylan   M        6788            D           n            5
17407      Jaxon   M        6107            J           n            5
17414     Nathan   M        5653            N           n            6
17416       Ryan   M        5286            R           n            4
17417     Adrian   M        5249            A           n            6
17420      Nolan   M        5164            N           n            5
17421  Christian   M        5043            C           n            9
17422      Aaron   M        5039            A           n            5
17423    Cameron   M        5019            C           n            7
17425     Colton   M        4980            C           n            6
17427     Landon   M        4747            L           n            6
17429   Jonathan   M        4690            J           n            8
17432     Easton   M        4613            E           n            6
17436      Roman   M        4445            R           n            5
17438    Jameson   M        4370            J           n            7
17440    Greyson   M        4331            G           n            7
17441     Jordan   M        4231            J           n            6
17442        Ian   M        4223            I           n            3
17443     Carson   M        4165            C           n            6
17444     Jaxson   M        4133            J           n            6
17448     Austin   M        3979            A           n            6
17458     Kayden   M        3613            K           n            6
17461     Declan   M        3576            D           n            6
17462     Waylon   M        3549            W           n            6
17463     Weston   M        3406            W           n            6
17464       Evan   M        3389            E           n            4
17469     Damian   M        3305            D           n            6
17470    Brayden   M        3253            B           n            7
17472      Rowan   M        3231            R           n            5
17473   Harrison   M        3202            H           n            8
17474     Bryson   M        3190            B           n            6
17477   Kingston   M        3135            K           n            8
17478      Jason   M        3073            J           n            5
17481      Ayden   M        2989            A           n            5
17491    Braxton   M        2747            B           n            7
17495     Ashton   M        2690            A           n            6

In [153]:
df.loc[(df['Sex']=='M') & (df['Last_Letter']=='n')]['Name_Count'].sum()

537262

In [172]:
df_last_letters_aenyhi_f=df.loc[(df['Sex']=='F') & (df['Last_Letter'].isin(['a','e','n','y','h','i']))]

In [202]:
df_last_letters_aenyhi_f.groupby('Last_Letter').head(5).to_clipboard()

In [177]:
df_last_letters_nrs_m=df.loc[(df['Sex']=='M') & (df['Last_Letter'].isin(['n','r','s']))]

In [208]:
df_last_letters_nrs_m.groupby('Last_Letter').head(5).to_clipboard()

In [184]:
df_m=df.loc[(df['Sex']=='M')]
df_f=df.loc[(df['Sex']=='F')]

In [187]:
df_m.head()

          Name Sex  Name_Count First_Letter Last_Letter  Name_Length
17360     Liam   M       19659            L           m            4
17361     Noah   M       18252            N           h            4
17362   Oliver   M       14147            O           r            6
17363   Elijah   M       13034            E           h            6
17364  William   M       12541            W           m            7

In [188]:
df_f.head()

        Name Sex  Name_Count First_Letter Last_Letter  Name_Length
0     Olivia   F       17535            O           a            6
1       Emma   F       15581            E           a            4
2        Ava   F       13084            A           a            3
3  Charlotte   F       13003            C           e            9
4     Sophia   F       12976            S           a            6

In [191]:
df_f_m = pd.merge(df_m,df_f,on='Name',suffixes=('_M','_F'))

In [193]:
df_f_m.head()

,Name,Sex_M,Name_Count_M,First_Letter_M,Last_Letter_M,Name_Length_M,Sex_F,Name_Count_F,First_Letter_F,Last_Letter_F,Name_Length_F
0,Liam,M,19659,L,m,4,F,31,L,m,4
1,Noah,M,18252,N,h,4,F,305,N,h,4
2,Oliver,M,14147,O,r,6,F,23,O,r,6
3,Elijah,M,13034,E,h,6,F,30,E,h,6
4,William,M,12541,W,m,7,F,13,W,m,7

In [200]:
df_f_m.loc[(df_f_m['Name_Count_M'] > 1000) & (df_f_m['Name_Count_F'] > 1000)]

,Name,Sex_M,Name_Count_M,First_Letter_M,Last_Letter_M,Name_Length_M,Sex_F,Name_Count_F,First_Letter_F,Last_Letter_F,Name_Length_F
87,Parker,M,3797,P,r,6,F,2131,P,r,6
104,Rowan,M,3231,R,n,5,F,1166,R,n,5
107,Sawyer,M,3156,S,r,6,F,1252,S,r,6
117,River,M,2771,R,r,5,F,1540,R,r,5
153,Hayden,M,2146,H,n,6,F,1078,H,n,6
170,Charlie,M,1853,C,e,7,F,2219,C,e,7
173,Blake,M,1797,B,e,5,F,1316,B,e,5
174,Avery,M,1773,A,y,5,F,6698,A,y,5
186,Phoenix,M,1504,P,x,7,F,1103,P,x,7
198,Riley,M,1350,R,y,5,F,5309,R,y,5
206,Emerson,M,1268,E,n,7,F,1774,E,n,7
228,Finley,M,1080,F,y,6,F,1429,F,y,6

In [206]:
df.loc[(df['Sex']=='F') & (df['First_Letter'].isin(['V','S','A']))].groupby('First_Letter').head(5)

          Name Sex  Name_Count First_Letter Last_Letter  Name_Length
2          Ava   F       13084            A           a            3
4       Sophia   F       12976            S           a            6
5       Amelia   F       12704            A           a            6
12     Abigail   F        7817            A           l            7
16       Sofia   F        6926            S           a            5
18       Avery   F        6698            A           y            5
20    Scarlett   F        6455            S           t            8
25        Aria   F        6093            A           a            4
33    Victoria   F        5249            V           a            8
36      Violet   F        5075            V           t            6
41      Stella   F        4624            S           a            6
62      Skylar   F        3608            S           r            6
72   Valentina   F        3331            V           a            9
100     Vivian   F        2680            V           n            6
144    Valerie   F        1867            V           e            7

In [207]:
df.loc[(df['Sex']=='M') & (df['First_Letter'].isin(['U','W','J']))].groupby('First_Letter').head(5)

          Name Sex  Name_Count First_Letter Last_Letter  Name_Length
17364  William   M       12541            W           m            7
17365    James   M       12250            J           s            5
17374    Jacob   M        9196            J           b            5
17376  Jackson   M        9051            J           n            7
17380     Jack   M        8876            J           k            4
17385   Joseph   M        8349            J           h            6
17388    Wyatt   M        8135            W           t            5
17457   Wesley   M        3668            W           y            6
17462   Waylon   M        3549            W           n            6
17463   Weston   M        3406            W           n            6
17821    Uriel   M         635            U           l            5
17995    Uriah   M         417            U           h            5
18234   Ulises   M         256            U           s            6
18414  Ulysses   M         188            U           s            7
18966     Umar   M         100            U           r            4

In [217]:
df.loc[(df['Sex']=='M') & (df['Last_Letter'].isin(['e','a','y']))].groupby('Last_Letter').head(5).to_clipboard()